EDT/УТ/src/DataProcessors/ЗагрузкаДанныхWIFIКомплектации_кудалению/ЗагрузкаДанныхWIFIКомплектации_кудалению.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаДанныхWIFIКомплектации_кудалению</name>
</mdclass:DataProcessor>

EDT/УТ/src/InformationRegisters/новаЗаданияРейсов/новаЗаданияРейсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>новаЗаданияРейсов</name>
  <resources>
    <name>Вид</name>
    <type>
      <types>EnumRef.новаВидыЗаданийРейсаМестнойДоставки</types>
    </type>
  </resources>
  <resources>
    <name>Доставка</name>
    <type>
      <types>BusinessProcessRef.новаМестнаяДоставка</types>
    </type>
  </resources>
  <resources>
    <name>ЗаданиеВыполнено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗаданиеВыполненоВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Рейс</name>
    <type>
      <types>BusinessProcessRef.новаРейсМестнойДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодТочки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЗадания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>МаршрутСопровождения</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Enums/ТипыЗагрузкиТСД/ТипыЗагрузкиТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЗагрузкиТСД</name>
  <enumValues>
    <name>ВозвратКомитенту</name>
  </enumValues>
  <enumValues>
    <name>Приход</name>
  </enumValues>
  <enumValues>
    <name>КорректировкиВозвратов</name>
  </enumValues>
  <enumValues>
    <name>ПриходWiFi</name>
  </enumValues>
  <enumValues>
    <name>ПриходWiFiПоСекторам</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаТранспортаWiFiПоСекторам</name>
  </enumValues>
  <enumValues>
    <name>ВозвратWiFiПоКонтрагентам</name>
  </enumValues>
  <enumValues>
    <name>НаборнаяВедомостьВозвраты</name>
  </enumValues>
  <enumValues>
    <name>ПриходWiFiVeeRoute</name>
  </enumValues>
  <enumValues>
    <name>ПриходOZONE</name>
  </enumValues>
  <enumValues>
    <name>ПриходWiFiVeeRouteСВесом</name>
  </enumValues>
  <enumValues>
    <name>Аксиомус</name>
  </enumValues>
  <enumValues>
    <name>ПриходWiFiVeeRouteСВыборкойНазад</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаЗаказовНаРегиональномТерминале</name>
  </enumValues>
  <enumValues>
    <name>ПогрузкаВАвто</name>
  </enumValues>
  <enumValues>
    <name>ПриездАвтоКомитента</name>
  </enumValues>
  <enumValues>
    <name>ПогрузкаВАвтоФактическая</name>
  </enumValues>
  <enumValues>
    <name>ПогрузкаВАвтоНезагруженныеЗаказы</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Documents/ЗагрузкаСТСД/ЗагрузкаСТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗагрузкаСТСД</name>
  <registerRecords>InformationRegister.ФиксацияВеса</registerRecords>
  <registerRecords>InformationRegister.ФиксацияОбъема</registerRecords>
  <registerRecords>InformationRegister.экУчетПроизводственныхОпераций</registerRecords>
  <registerRecords>InformationRegister.УчетВыходаНаРаботуСотрудниковКомпании</registerRecords>
  <registerRecords>InformationRegister.СтатусыСкладскогоУчета</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗагрузкиТСД</name>
    <type>
      <types>EnumRef.ТипыЗагрузкиТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>Ид_Документа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ид_Терминала</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Завершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Изменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтрокФакт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерверТСД</name>
    <type>
      <types>CatalogRef.СерверыWiFiТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусыВыгруженыВАдминку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектронныеВесы</name>
    <type>
      <types>CatalogRef.ЭлектронныеВесы</types>
    </type>
  </attributes>
  <attributes>
    <name>СчитыватьВес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТерминалПриема</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТерминалДоставки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПриходПринципала</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛинейкаИзмеренияГабаритов</name>
    <type>
      <types>CatalogRef.ЛинейкиИзмеренияГабаритов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВспомогательныйРежимТСД</name>
    <type>
      <types>EnumRef.ТипыЗагрузкиТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПалеты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТСД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Штрихкоды</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.ЗаборТовара</types>
        <types>DocumentRef.Фрахт</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>РезультатДоставки</name>
      <type>
        <types>CatalogRef.новаРезультатМестнойДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаНевыполнения</name>
      <type>
        <types>CatalogRef.ПричиныНеВыполненияДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗаказа</name>
      <type>
        <types>EnumRef.ТипыЗаказов</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнешнийНомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМест</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакСтабильностиВесов</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВремя</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>НеизвестныйТовар</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СканированныйОбъем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Флаг</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>22</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МестоЗаказа</name>
      <type>
        <types>CatalogRef.МестаПоЗаказам</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерПалеты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсключитьЧастичноПринятыйЗаказИзРейса</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИзмерениеГабаритов</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодГабарита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Измерение</name>
      <type>
        <types>EnumRef.Измерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеИзмерения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтменаИзмерения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>БэйджиСотрудников</name>
    <attributes>
      <name>БейджСотрудника</name>
      <type>
        <types>CatalogRef.БэйджиСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.новаЭкспедиторы</types>
        <types>CatalogRef.новаВодители</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипУчастникаЭкипажа</name>
      <type>
        <types>EnumRef.УчастникЭкипажа</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СервисныеШК</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Режим</name>
      <type>
        <types>EnumRef.ТипыЗагрузкиТСД</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаказыРейса</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИгнорируемыеШтрихкоды</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерПалеты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяСканирования</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/DataProcessors/ЗагрузкаДанныхWIFIКомплектации_кудалению/ObjectModule.bsl
Процедура СформироватьДанные() Экспорт
	#Если Клиент Тогда
		Сообщить("Начало загрузки документов с сервера ТСД (" + Формат(ТекущаяДата(), "ДЛФ=DDT") + ")");
	#КонецеСли
	
	lem.РегламентЗагрузкаДанныхСТСД();
	
	#Если Клиент Тогда
		Сообщить("Загрузка документов с сервера ТСД окончена (" + Формат(ТекущаяДата(), "ДЛФ=DDT") + ")");
		Сообщить("-----------------------------------");
		Сообщить("Формирование маршрутных листов (" + Формат(ТекущаяДата(), "ДЛФ=DDT") + ")");
	#КонецеСли
	
	Зап = Новый Запрос;
	
	Зап.Текст = "ВЫБРАТЬ
	            |	ЗагрузкаСТСДШтрихкоды.Заказ,
	            |	ЗагрузкаСТСДШтрихкоды.КоличествоМест
	            |ПОМЕСТИТЬ ВТПриход
	            |ИЗ
	            |	Документ.ЗагрузкаСТСД.Штрихкоды КАК ЗагрузкаСТСДШтрихкоды
	            |ГДЕ
	            |	ЗагрузкаСТСДШтрихкоды.Ссылка.ТипЗагрузкиТСД В (ЗНАЧЕНИЕ(Перечисление.ТипыЗагрузкиТСД.ЗагрузкаТранспортаWiFiПоСекторам), ЗНАЧЕНИЕ(Перечисление.ТипыЗагрузкиТСД.ПриходWiFiПоСекторам), ЗНАЧЕНИЕ(Перечисление.ТипыЗагрузкиТСД.ПриходWiFi))
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	ЗагрузкаСТСДШтрихкоды.Заказ,
	            |	ЗагрузкаСТСДШтрихкоды.Ссылка.Ссылка КАК ДокТСД,
	            |	СУММА(ЗагрузкаСТСДШтрихкоды.КоличествоМест) КАК КоличествоМест,
	            |	новаЗаданияРейсов.Рейс
	            |ПОМЕСТИТЬ ВТЗагруженныеЗаказы
	            |ИЗ
	            |	Документ.ЗагрузкаСТСД.Штрихкоды КАК ЗагрузкаСТСДШтрихкоды
	            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.новаЗаданияРейсов КАК новаЗаданияРейсов
	            |		ПО (ВЫРАЗИТЬ(ЗагрузкаСТСДШтрихкоды.Заказ КАК Документ.РеализацияТоваровУслуг).Номер = новаЗаданияРейсов.Доставка.Номер)
	            |ГДЕ
	            |	ЗагрузкаСТСДШтрихкоды.Ссылка.Дата >= &ДатаНачалаВыборкиДанных
	            |	И ЗагрузкаСТСДШтрихкоды.Ссылка.ТипЗагрузкиТСД = ЗНАЧЕНИЕ(Перечисление.ТипыЗагрузкиТСД.ЗагрузкаТранспортаWiFiПоСекторам)
	            |	И (ВЫРАЗИТЬ(ЗагрузкаСТСДШтрихкоды.Заказ КАК Документ.РеализацияТоваровУслуг)) <> ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)
	            |
	            |СГРУППИРОВАТЬ ПО
	            |	ЗагрузкаСТСДШтрихкоды.Заказ,
	            |	ЗагрузкаСТСДШтрихкоды.Ссылка.Ссылка,
	            |	новаЗаданияРейсов.Рейс
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	ВТЗагруженныеЗаказы.Заказ,
	            |	ЕСТЬNULL(МаршрутныйЛистСкладаШтрихкоды.Ссылка, ИСТИНА) КАК КОтбору,
	            |	ВТЗагруженныеЗаказы.ДокТСД,
	            |	СУММА(ВТЗагруженныеЗаказы.КоличествоМест) КАК КоличествоМест,
	            |	ВТЗагруженныеЗаказы.Рейс
	            |ПОМЕСТИТЬ ВТЗаказыКФормированию
	            |ИЗ
	            |	ВТЗагруженныеЗаказы КАК ВТЗагруженныеЗаказы
	            |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.МаршрутныйЛистСклада.Штрихкоды КАК МаршрутныйЛистСкладаШтрихкоды
	            |		ПО (ВЫРАЗИТЬ(ВТЗагруженныеЗаказы.Заказ КАК Документ.РеализацияТоваровУслуг).Ссылка = (ВЫРАЗИТЬ(МаршрутныйЛистСкладаШтрихкоды.Заказ.Ссылка КАК Документ.РеализацияТоваровУслуг))
	            |				И МаршрутныйЛистСкладаШтрихкоды.Ссылка.ПометкаУдаления = ЛОЖЬ)
	            |
	            |СГРУППИРОВАТЬ ПО
	            |	ВТЗагруженныеЗаказы.Заказ,
	            |	ЕСТЬNULL(МаршрутныйЛистСкладаШтрихкоды.Ссылка, ИСТИНА),
	            |	ВТЗагруженныеЗаказы.ДокТСД,
	            |	ВТЗагруженныеЗаказы.Рейс
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	новаЗаданияРейсов.Рейс,
	            |	РеализацияТоваровУслуг.Ссылка КАК Заказ
	            |ПОМЕСТИТЬ ВТЗаказыПоРейсам
	            |ИЗ
	            |	РегистрСведений.новаЗаданияРейсов КАК новаЗаданияРейсов
	            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	            |		ПО новаЗаданияРейсов.Доставка.Номер = РеализацияТоваровУслуг.Номер
	            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗаказыКФормированию КАК ВТЗаказыКФормированию
	            |		ПО новаЗаданияРейсов.Рейс = ВТЗаказыКФормированию.Рейс
	            |ГДЕ
	            |	новаЗаданияРейсов.Доставка.Дата >= &ДатаНачалаВыборкиДанных
	            |	И новаЗаданияРейсов.МаршрутСопровождения = ЛОЖЬ
	            |	И новаЗаданияРейсов.Рейс.ДатаНачала >= &ДатаНачалаВыборкиДанных
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	ВТЗаказыПоРейсам.Заказ,
	            |	ВТЗаказыКФормированию.ДокТСД КАК ДокТСД,
	            |	ВТЗаказыПоРейсам.Рейс КАК Рейс,
	            |	ВТЗаказыПоРейсам.Рейс.Транспорт КАК Транспорт,
	            |	ВЫБОР
	            |		КОГДА ЕСТЬNULL(ВТПриход.Заказ, ИСТИНА) = ИСТИНА
	            |			ТОГДА ЛОЖЬ
	            |		ИНАЧЕ ИСТИНА
	            |	КОНЕЦ КАК ЕстьВПриходе,
	            |	ВЫБОР
	            |		КОГДА ЕСТЬNULL(ВТЗаказыКФормированию.Заказ, ИСТИНА) = ИСТИНА
	            |			ТОГДА ЛОЖЬ
	            |		ИНАЧЕ ИСТИНА
	            |	КОНЕЦ КАК Отсканирован,
	            |	ВТПриход.КоличествоМест КАК КоличествоМестВПриходе,
	            |	ЕСТЬNULL(ВТЗаказыКФормированию.КоличествоМест, 0) КАК Поле1
	            |ИЗ
	            |	ВТЗаказыПоРейсам КАК ВТЗаказыПоРейсам
	            |		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаказыКФормированию КАК ВТЗаказыКФормированию
	            |			ЛЕВОЕ СОЕДИНЕНИЕ ВТПриход КАК ВТПриход
	            |			ПО ((ВЫРАЗИТЬ(ВТЗаказыКФормированию.Заказ КАК Документ.РеализацияТоваровУслуг)) = (ВЫРАЗИТЬ(ВТПриход.Заказ КАК Документ.РеализацияТоваровУслуг)))
	            |		ПО (ВТЗаказыКФормированию.КОтбору = ИСТИНА)
	            |			И (ВТЗаказыПоРейсам.Заказ = (ВЫРАЗИТЬ(ВТЗаказыКФормированию.Заказ КАК Документ.РеализацияТоваровУслуг)))
	            |
	            |СГРУППИРОВАТЬ ПО
	            |	ВТЗаказыКФормированию.ДокТСД,
	            |	ВТЗаказыПоРейсам.Рейс,
	            |	ВТЗаказыПоРейсам.Рейс.Транспорт,
	            |	ВТПриход.КоличествоМест,
	            |	ВЫБОР
	            |		КОГДА ЕСТЬNULL(ВТПриход.Заказ, ИСТИНА) = ИСТИНА
	            |			ТОГДА ЛОЖЬ
	            |		ИНАЧЕ ИСТИНА
	            |	КОНЕЦ,
	            |	ВТЗаказыПоРейсам.Заказ,
	            |	ЕСТЬNULL(ВТЗаказыКФормированию.КоличествоМест, 0),
	            |	ВЫБОР
	            |		КОГДА ЕСТЬNULL(ВТЗаказыКФормированию.Заказ, ИСТИНА) = ИСТИНА
	            |			ТОГДА ЛОЖЬ
	            |		ИНАЧЕ ИСТИНА
	            |	КОНЕЦ
	            |ИТОГИ ПО
	            |	Рейс,
	            |	ДокТСД";
				
	Зап.УстановитьПараметр("ДатаНачалаВыборкиДанных", НачалоДня(ТекущаяДата()));	
	
	Рез = Зап.Выполнить();
	
	ДЗ = Рез.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Для Каждого СтрокаРейс Из ДЗ.Строки Цикл
		НовДок = Документы.МаршрутныйЛистСклада.СоздатьДокумент();
		НовДок.Рейс = СтрокаРейс.Рейс;
		НовДок.Транспорт = СтрокаРейс.Транспорт;
		ОтсканированХотьОдин = Ложь;
		Для Каждого СтрокаТСД Из СтрокаРейс.Строки Цикл
			НовТСД = НовДок.ЗагрузкиТСД.Добавить();
			НовТСД.ЗагрузкаТСД = СтрокаТСД.ДокТСД;
			Для Каждого СтрокаЗаказ Из СтрокаТСД.Строки Цикл
				Нов = НовДок.Штрихкоды.Добавить();
				ЗаполнитьЗначенияСвойств(Нов, СтрокаЗаказ);
				Если Не ОтсканированХотьОдин Тогда
					ОтсканированХотьОдин = СтрокаЗаказ.Отсканирован;
				КонецеСли;	
			КонецЦикла;	
		КонецЦикла;	
		НовДок.Дата = ТекущаяДата();
		Если ОтсканированХотьОдин Тогда
			НовДок.Записать(РежимЗаписиДокумента.Запись);
			#Если Клиент Тогда
				Сообщить("-------------------" + НовДок.Транспорт.Наименование + "-------------------");
			#КонецеСли
		КонецеСли;	
	КонецЦикла;	
	
	#Если Клиент Тогда
		Сообщить("-----------------------------------");
		Сообщить("Формирование маршрутных листов окончено (" + Формат(ТекущаяДата(), "ДЛФ=DDT") + ")");
	#КонецеСли
КонецПроцедуры
